test/nylon_ball_in_silicon_oil_tube/impl_FD/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    root            "";
    case            "";
    instance        "";
    local           "";
    class           dictionary;
    object          couplingProperties;
}

/* ---------------------------- sub-models & settings ---------------------------- */

modelType none;

couplingInterval 50;

globalForce globalForce;

refineMeshSkin 1.1;

forceModels
(
    ArchimedesIB
    ShirgaonkarIB
);

voidFractionModel IB;

locateModel engineIB;

dataExchangeModel twoWayMPI;

turbulenceModelType turbulenceProperties;

/* ---------------------------- sub-model properties ------------------------- */

"(globalForceProps|mixGlobalForceProps)"
{
  velFieldName "U";
  volumeFractionFieldName "volumeFraction";
  gravityFieldName "g";
}

ArchimedesIBProps
{
    verbose true;
}

ShirgaonkarIBProps
{
    useTorque true;
    verbose true;
}

twoWayMPIProps
{
    liggghtsPath "../DEM/in.liggghts_run";
}

IBProps
{
    maxCellsNumPerCoarseParticle 10000000;
}

engineIBProps
{
    treeSearch true;
    zSplit 8;
    xySplit 16;
}
